---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.TextLabelType
source: html/75e265b0-7433-2253-62c5-7e4309dce74d.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.TextLabelType Property

Type of diagram text label visualization.

## Syntax (C#)
```csharp
public AnalysisDisplayStyleMarkerTextLabelType TextLabelType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration